#pragma once

// Tribes Vengeance (1) SDK

#include "TV_MISSING.hpp"

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

namespace SDK
{
typedef uint8_t ETexClampMode;
typedef uint8_t EenumBaseType;
typedef uint8_t EMessageBoxResult;
typedef uint8_t EeTribesGameState;
typedef uint8_t EMusicTransition;
typedef uint8_t EDoubleClickDir;
typedef uint8_t EGetPointAxis;
typedef uint8_t EMenuSound;
typedef uint8_t ELinkState;
typedef uint8_t EeIconPosition;
typedef uint8_t EParticleDrawStyle;
typedef uint8_t ELODSet;
typedef uint8_t EParticleCoordinateSystem;
typedef uint8_t EMaterialVisualType;
typedef uint8_t EOrientationConstraint;
typedef uint8_t EFilterState;
typedef uint8_t EAxis;
typedef uint8_t ETeamAlignment;
typedef uint8_t EVehiclePositionType;
typedef uint8_t EPhysics;
typedef uint8_t EParticleStartLocationShape;
typedef uint8_t ERepDataType;
typedef uint8_t EHorizontalFill;
typedef uint8_t EMessageType;
typedef uint8_t EMaterialSequenceTriggerActon;
typedef uint8_t EParticleRotationSource;
typedef uint8_t EProjectileDamageStat;
typedef uint8_t ESoundOcclusion;
typedef uint8_t EUseablePointValid;
typedef uint8_t EFrameBufferBlending;
typedef uint8_t ELevelAction;
typedef uint8_t ERenderDetailSetting;
typedef uint8_t ETriggerType;
typedef uint8_t EWeatherType;
typedef uint8_t EGroundMovementModeType;
typedef uint8_t EDrawType;
typedef uint8_t ETexRotationType;
typedef uint8_t ELightType;
typedef uint8_t ETeamAffiliationResult;
typedef uint8_t EJetCompetencyLevels;

typedef uint8_t ECombatRangeCategories;
typedef uint8_t EeScrollState;
typedef uint8_t ETextureFormat;
typedef uint8_t EMovementState;
typedef uint8_t EPainReactionCategories;
typedef uint8_t EAccelerationEffectStateEnum;
typedef uint8_t EObjectiveStatus;
typedef uint8_t EMoverGlideType;
typedef uint8_t EEnvMapTransformType;
typedef uint8_t ECarriedObjectState;
typedef uint8_t EAnimationStateEnum;
typedef uint8_t EeDeployableInfo;
typedef uint8_t EHavokHingeType;
typedef uint8_t EPlatform;
typedef uint8_t ETexOscillationType;
typedef uint8_t EPerPixelSpecular;
typedef uint8_t EDetailMode;
typedef uint8_t ECombatMovementCategories;
typedef uint8_t EPerPixelSpecularType;
typedef uint8_t EAlertnessModeType;
typedef uint8_t EOptimizeOption;
typedef uint8_t ETexCoordSrc;
typedef uint8_t ETravelType;
typedef uint8_t EAnimationChannelIndex;
typedef uint8_t EProjectorBlending;
typedef uint8_t EMenuRenderStyle;
typedef uint8_t EChannelID;
typedef uint8_t EReceiveMode;
typedef uint8_t EAlertnessLevels;
typedef uint8_t ETriggerCategories;
typedef uint8_t EVerticalAlignment;
typedef uint8_t EGroundMovementLevels;
typedef uint8_t EDirectionType;
typedef uint8_t EHavokHingeMotorType;
typedef uint8_t EVerticalFill;
typedef uint8_t EePackState;
typedef uint8_t ETexCoordCount;
typedef uint8_t EHavokSteerType;
typedef uint8_t EDodgingCategories;
typedef uint8_t ETextAlign;
typedef uint8_t EAnimationType;
typedef uint8_t ESkelLocationUpdate;
typedef uint8_t EeMenuState;
typedef uint8_t EDLM_ReturnCodes;
typedef uint8_t EParticleCollisionSound;
typedef uint8_t ESteerType;
typedef uint8_t EeTextAlign;
typedef uint8_t EFiringWhileMovingStates;
typedef uint8_t ESoundStreamType;
typedef uint8_t EGrenadeUseCategories;
typedef uint8_t ESensorDataType;
typedef uint8_t EAI_LOD_Levels;
typedef uint8_t EMusicType;
typedef uint8_t ELightEffect;
typedef uint8_t EDynamicMusicType;
typedef uint8_t EAutoComputeConstraint;
typedef uint8_t EVDLM_ReturnCodes;
typedef uint8_t EeComponentSize;
typedef uint8_t ESpeedPackUseCategories;
typedef uint8_t EClickSound;
typedef uint8_t EMovementDirectionalInput;
typedef uint8_t EOpTest;
typedef uint8_t EObjectiveType;
typedef uint8_t EWinMessage;
typedef uint8_t EPassAsTag;
typedef uint8_t EAllyType;
typedef uint8_t EInputKey;
typedef uint8_t EOpeningState;
typedef uint8_t ELookAtType;
typedef uint8_t ERenderStyle;
typedef uint8_t EeScriptType;
typedef uint8_t EMessageBoxButtons;
typedef uint8_t EColorType;
typedef uint8_t ELinkMode;
typedef uint8_t ENetRole;
typedef uint8_t EParticleDirectionUsage;
typedef uint8_t ETextureDetail;
typedef uint8_t EAlphaOperation;
typedef uint8_t EParticleEffectAxis;
typedef uint8_t ELOA_AvoidDirections;
typedef uint8_t EFrameHitTest;
typedef uint8_t ETextAlignment;
typedef uint8_t EInputAction;

//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Object.TsMojoAction
// 0x0040 (0x0068 - 0x0028)
class UClass_Object_TsMojoAction : public UClass_Object
{
public:
	class AClass_Object_Actor*                         Actor;                                                    // 0x0028(0x0004) (Const, Transient)
	unsigned long                                      m_skip_action : 1;                                        // 0x002C(0x0004) (Const, Transient, NoExport)
	class UClass_Object*                               m_source_key;                                             // 0x0030(0x0004) (Const, Transient, NoExport)
	class UClass_Object*                               m_output_key;                                             // 0x0034(0x0004) (Const, Transient, NoExport)
	class UClass_Object*                               m_group;                                                  // 0x0038(0x0004) (Const, Transient, NoExport)
	float                                              m_start_time;                                             // 0x003C(0x0004) (Const, Transient, NoExport)
	float                                              m_offset;                                                 // 0x0040(0x0004) (Const, Transient, NoExport)
	float                                              m_predicted_start_time;                                   // 0x0044(0x0004) (Const, Transient, NoExport)
	float                                              m_recorded_length;                                        // 0x0048(0x0004) (Const, Transient, NoExport)
	unsigned long                                      m_length_dirty : 1;                                       // 0x004C(0x0004) (Const, Transient, NoExport)
	TArray<class UClass_Object_TsMojoAction*>          m_subaction_list;                                         // 0x0050(0x000C) (Const, Transient, NeedCtorLink, NoExport)
	float                                              m_subaction_offset;                                       // 0x005C(0x0004) (Const, Transient, NoExport)
	class UClass_Object_TsMojoAction*                  m_subaction_parent;                                       // 0x0060(0x0004) (Const, Transient, NoExport)
	int                                                m_subaction_track;                                        // 0x0064(0x0004) (Const, Transient, NoExport)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction");
		return ptr;
	}


	float Function_GetDuration();
	bool Function_SetDuration(float duration);
	void Function_Resume();
	void Function_Pause();
	void Function_Interrupt();
	void Function_OnDelete();
	bool Function_CanGenerateOutputKeys();
	bool Function_CanAcceptSubactions();
	bool Function_IsSubaction();
	bool Function_DisableActionInMojo();
	bool Function_ModifiesActorLocation();
	bool Function_CanSetDuration();
	bool Function_CanFastForwardSkip();
	bool Function_CanBeUsedWith(class AClass_Object_Actor* Actor);
	struct FString Function_GetSummaryString();
	struct FString Function_GetHelpString();
	struct FString Function_GetTrackString();
	struct FString Function_GetNameString();
	bool Function_EndCutscene();
	void Function_Finish();
	bool Function_Tick(float Delta);
	bool Function_Start();
	struct FStruct_MojoActorRef Function_ResolveActorRef(const struct FStruct_MojoActorRef& ref);
};


// Class Object.TsMojoAction.TsAction
// 0x0030 (0x0098 - 0x0068)
class UClass_Object_TsMojoAction_TsAction : public UClass_Object_TsMojoAction
{
public:
	struct FString                                     DName;                                                    // 0x0068(0x000C) (NeedCtorLink)
	struct FString                                     Track;                                                    // 0x0074(0x000C) (NeedCtorLink)
	struct FString                                     Help;                                                     // 0x0080(0x000C) (NeedCtorLink)
	unsigned long                                      FastForwardSkip : 1;                                      // 0x008C(0x0004)
	unsigned long                                      ModifiesLocation : 1;                                     // 0x008C(0x0004)
	unsigned long                                      DisableInMojo : 1;                                        // 0x008C(0x0004)
	unsigned long                                      UsesDuration : 1;                                         // 0x008C(0x0004)
	unsigned long                                      bShowSubtitles : 1;                                       // 0x008C(0x0004) (Config)
	float                                              interpTime;                                               // 0x0090(0x0004) (Transient)
	int                                                interpolator;                                             // 0x0094(0x0004) (Const, Transient, NoExport)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction");
		return ptr;
	}


	bool Function_ShouldShowSubtitles();
	bool Function_tickInterpolation(float Delta, float* Alpha);
	void Function_resetInterpolation(float easeIn, float duration, float easeOut);
	bool Function_DisableActionInMojo_DisableActionInMojo();
	bool Function_ModifiesActorLocation_ModifiesActorLocation();
	bool Function_CanSetDuration_CanSetDuration();
	bool Function_CanFastForwardSkip_CanFastForwardSkip();
	struct FString Function_GetHelpString_GetHelpString();
	struct FString Function_GetTrackString_GetTrackString();
	struct FString Function_GetNameString_GetNameString();
	void Function_Message(class UClass_Object_Message* msg);
	void Function_Finish_Finish();
	bool Function_Tick_Tick(float Delta);
	bool Function_Start_Start();
	struct FString Function_GetSummaryString_GetSummaryString();
	float Function_GetLength();
	void Function_OnFinish();
	bool Function_OnTick(float Delta);
	bool Function_OnStart();
};


// Class Object.TsMojoAction.TsAction.TsPawnAction
// 0x0004 (0x009C - 0x0098)
class UClass_Object_TsMojoAction_TsAction_TsPawnAction : public UClass_Object_TsMojoAction_TsAction
{
public:
	class AClass_Object_Actor_Pawn*                    Pawn;                                                     // 0x0098(0x0004) (Transient)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction.TsPawnAction");
		return ptr;
	}


	bool Function_CanBeUsedWith_CanBeUsedWith(class AClass_Object_Actor* Actor);
	bool Function_Start_Start_Start();
};


// Class Object.TsMojoAction.TsAction.TsPawnAction.TsActionPlayLIPSinc
// 0x0044 (0x00E0 - 0x009C)
class UClass_Object_TsMojoAction_TsAction_TsPawnAction_TsActionPlayLIPSinc : public UClass_Object_TsMojoAction_TsAction_TsPawnAction
{
public:
	struct FString                                     FileName;                                                 // 0x009C(0x000C) (Edit, NeedCtorLink, NoClear)
	struct FString                                     SectionName;                                              // 0x00A8(0x000C) (Edit, NeedCtorLink, NoClear)
	struct FString                                     TextName;                                                 // 0x00B4(0x000C) (Edit, NeedCtorLink, NoClear)
	struct FString                                     Path;                                                     // 0x00C0(0x000C) (Edit, NeedCtorLink, NoClear)
	struct FName                                       LIPSincAnimName;                                          // 0x00CC(0x0004) (Edit)
	float                                              Volume;                                                   // 0x00D0(0x0004) (Edit)
	float                                              Radius;                                                   // 0x00D4(0x0004) (Edit)
	float                                              Pitch;                                                    // 0x00D8(0x0004) (Edit)
	unsigned long                                      bAttenuate : 1;                                           // 0x00DC(0x0004) (Edit)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction.TsPawnAction.TsActionPlayLIPSinc");
		return ptr;
	}


	bool Function_CanGenerateOutputKeys_CanGenerateOutputKeys();
	void Function_Resume_Resume();
	void Function_Pause_Pause();
	void Function_Interrupt_Interrupt();
	void Function_OnFinish_OnFinish();
	bool Function_OnTick_OnTick(float Delta);
	bool Function_OnStart_OnStart();
	void Function_ResumeLIPSinc();
	void Function_StopLIPSinc();
	void Function_PauseLIPSinc();
};


// Class Object.TsMojoAction.TsAction.TsActionInterpolateBase
// 0x0078 (0x0110 - 0x0098)
class UClass_Object_TsMojoAction_TsAction_TsActionInterpolateBase : public UClass_Object_TsMojoAction_TsAction
{
public:
	struct FStruct_MojoKeyframe                        cur_keyframe;                                             // 0x0098(0x0018) (Const)
	struct FStruct_Vector                              src_tangent;                                              // 0x00B0(0x000C) (Const)
	struct FStruct_Vector                              dest_tangent;                                             // 0x00BC(0x000C) (Const)
	struct FStruct_Vector                              src_position;                                             // 0x00C8(0x000C) (Const)
	struct FStruct_Vector                              dest_position;                                            // 0x00D4(0x000C) (Const)
	float                                              sqx;                                                      // 0x00E0(0x0004) (Const, Transient, NoExport)
	float                                              sqy;                                                      // 0x00E4(0x0004) (Const, Transient, NoExport)
	float                                              sqz;                                                      // 0x00E8(0x0004) (Const, Transient, NoExport)
	float                                              sqw;                                                      // 0x00EC(0x0004) (Const, Transient, NoExport)
	float                                              dqx;                                                      // 0x00F0(0x0004) (Const, Transient, NoExport)
	float                                              dqy;                                                      // 0x00F4(0x0004) (Const, Transient, NoExport)
	float                                              dqz;                                                      // 0x00F8(0x0004) (Const, Transient, NoExport)
	float                                              dqw;                                                      // 0x00FC(0x0004) (Const, Transient, NoExport)
	float                                              iqx;                                                      // 0x0100(0x0004) (Const, Transient, NoExport)
	float                                              iqy;                                                      // 0x0104(0x0004) (Const, Transient, NoExport)
	float                                              iqz;                                                      // 0x0108(0x0004) (Const, Transient, NoExport)
	float                                              iqw;                                                      // 0x010C(0x0004) (Const, Transient, NoExport)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction.TsActionInterpolateBase");
		return ptr;
	}


	void Function_FinishActorInterpolation();
	void Function_StartActorInterpolation();
	void Function_ApplyCurrentKeyframePos();
};


// Class Object.TsMojoAction.TsAction.TsActionInterpolateBase.TsActionKeyframeInterpolate
// 0x0058 (0x0168 - 0x0110)
class UClass_Object_TsMojoAction_TsAction_TsActionInterpolateBase_TsActionKeyframeInterpolate : public UClass_Object_TsMojoAction_TsAction_TsActionInterpolateBase
{
public:
	float                                              duration;                                                 // 0x0110(0x0004) (Edit)
	float                                              ease_in_time;                                             // 0x0114(0x0004) (Edit)
	float                                              ease_out_time;                                            // 0x0118(0x0004) (Edit)
	unsigned long                                      snap_to_first_key : 1;                                    // 0x011C(0x0004) (Edit)
	unsigned long                                      use_linear_rotation : 1;                                  // 0x011C(0x0004) (Edit)
	TArray<struct FStruct_MojoKeyframe>                keys;                                                     // 0x0120(0x000C) (Edit, NeedCtorLink)
	TEnumAsByte<ELookAtType>                           look_at_type;                                             // 0x012C(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x012D(0x0003) MISSED OFFSET
	struct FStruct_MojoKeyframe                        look_at_point;                                            // 0x0130(0x0018) (Edit)
	struct FStruct_MojoActorRef                        look_at_actor;                                            // 0x0148(0x0008) (Edit)
	float                                              look_at_ease_time;                                        // 0x0150(0x0004) (Edit)
	float                                              cur_time;                                                 // 0x0154(0x0004)
	int                                                cur_key;                                                  // 0x0158(0x0004) (Const)
	float                                              src_key_distance;                                         // 0x015C(0x0004) (Const)
	float                                              dest_key_distance;                                        // 0x0160(0x0004) (Const)
	int                                                spline;                                                   // 0x0164(0x0004) (Const, Transient, NoExport)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction.TsActionInterpolateBase.TsActionKeyframeInterpolate");
		return ptr;
	}


	float Function_GetDuration_GetDuration();
	bool Function_SetDuration_SetDuration(float _duration);
	void Function_OnFinish_OnFinish();
	bool Function_OnTick_OnTick(float Delta);
	bool Function_OnStart_OnStart();
	bool Function_UpdateCurrentKeyframePos(float Time);
	void Function_CalculateConstants(const struct FStruct_Vector& initial_pos, const struct FStruct_Rotator& initial_rot);
};


// Class Object.TsMojoAction.TsAction.TsActionInterpolateBase.TsActionInterpolateTo
// 0x0028 (0x0138 - 0x0110)
class UClass_Object_TsMojoAction_TsAction_TsActionInterpolateBase_TsActionInterpolateTo : public UClass_Object_TsMojoAction_TsAction_TsActionInterpolateBase
{
public:
	struct FStruct_MojoKeyframe                        Target;                                                   // 0x0110(0x0018) (Edit)
	float                                              duration;                                                 // 0x0128(0x0004) (Edit)
	float                                              ease_in_time;                                             // 0x012C(0x0004) (Edit)
	float                                              ease_out_time;                                            // 0x0130(0x0004) (Edit)
	float                                              elapsed_duration;                                         // 0x0134(0x0004)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction.TsActionInterpolateBase.TsActionInterpolateTo");
		return ptr;
	}


	float Function_GetDuration_GetDuration();
	bool Function_SetDuration_SetDuration(float _duration);
	void Function_OnFinish_OnFinish();
	bool Function_OnTick_OnTick(float Delta);
	bool Function_OnStart_OnStart();
	void Function_UpdateCurrentKeyframePos(float Time);
	void Function_CalculateConstants(const struct FStruct_Vector& initial_pos, const struct FStruct_Rotator& initial_rot);
};


// Class Object.TsMojoAction.TsAction.TsActionSnapTo
// 0x001C (0x00B4 - 0x0098)
class UClass_Object_TsMojoAction_TsAction_TsActionSnapTo : public UClass_Object_TsMojoAction_TsAction
{
public:
	struct FStruct_MojoKeyframe                        Target;                                                   // 0x0098(0x0018) (Edit)
	unsigned long                                      reset_animation : 1;                                      // 0x00B0(0x0004) (Edit)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction.TsActionSnapTo");
		return ptr;
	}


	bool Function_OnTick_OnTick(float Delta);
	bool Function_OnStart_OnStart();
};


// Class Object.TsMojoAction.TsAction.TsCameraAction
// 0x0004 (0x009C - 0x0098)
class UClass_Object_TsMojoAction_TsAction_TsCameraAction : public UClass_Object_TsMojoAction_TsAction
{
public:
	class AClass_Object_Actor_Controller_PlayerController* PC;                                                       // 0x0098(0x0004) (Transient)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.TsMojoAction.TsAction.TsCameraAction");
		return ptr;
	}


	bool Function_CanBeUsedWith_CanBeUsedWith(class AClass_Object_Actor* Actor);
	bool Function_Start_Start_Start();
};


// Class Object.xUtil
// 0x0004 (0x002C - 0x0028)
class UClass_Object_xUtil : public UClass_Object
{
public:
	class UClass_Object_xUtil_CacheMutators*           CachedMutatorList;                                        // 0x0028(0x0004) (Edit, Const, Transient)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.xUtil");
		return ptr;
	}


	void STATIC_Function_GetMutatorList(TArray<struct FStruct_MutatorRecord>* MutatorRecords);
};


// Class Object.xUtil.CacheMutators
// 0x000C (0x0038 - 0x002C)
class UClass_Object_xUtil_CacheMutators : public UClass_Object_xUtil
{
public:
	TArray<struct FStruct_MutatorRecord>               Records;                                                  // 0x002C(0x000C) (NeedCtorLink)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.xUtil.CacheMutators");
		return ptr;
	}

};


// Class Object.RefCount
// 0x0010 (0x0038 - 0x0028)
class UClass_Object_RefCount : public UClass_Object
{
public:
	int                                                m_RefCount;                                               // 0x0028(0x0004) (Const)
	TArray<int>                                        LatentStackLocations;                                     // 0x002C(0x000C) (Const, Transient, NeedCtorLink)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.RefCount");
		return ptr;
	}


	int Function_Release();
	int Function_AddRef();
};


// Class Object.RefCount.VisionNotifier
// 0x0010 (0x0048 - 0x0038)
class UClass_Object_RefCount_VisionNotifier : public UClass_Object_RefCount
{
public:
	class AClass_Object_Actor_Pawn*                    Viewer;                                                   // 0x0038(0x0004)
	int                                                SeenListPadding;                                          // 0x003C(0x0004) (Const, Transient)
	int                                                CurrentSeenListPadding;                                   // 0x0040(0x0004) (Const, Transient)
	int                                                NotificationListPadding;                                  // 0x0044(0x0004) (Const, Transient)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.RefCount.VisionNotifier");
		return ptr;
	}


	void Function_logSeenList();
	void Function_UnregisterVisionNotification(class UClass_Object_IVisionNotification* Registrant);
	void Function_RegisterVisionNotification(class UClass_Object_IVisionNotification* Registrant);
	bool Function_IsOnSeenList(class AClass_Object_Actor_Pawn* TestPawn);
	bool Function_IsOnCurrentSeenList(class AClass_Object_Actor_Pawn* TestPawn);
	bool Function_isVisible(class AClass_Object_Actor_Pawn* TestPawn);
	void Function_RemoveAnyReferencesToPawn(class AClass_Object_Actor_Pawn* PawnBeingRemoved);
	void Function_OnOtherPawnDied(class AClass_Object_Actor_Pawn* DeadPawn);
	void Function_OnOtherActorDestroyed(class AClass_Object_Actor* ActorBeingDestroyed);
	void Function_CleanupVisionNotifier();
	void Function_InitializeVisionNotifier(class AClass_Object_Actor_Pawn* InViewer);
};


// Class Object.RefCount.VisionNotifier.TribesVisionNotifier
// 0x0000 (0x0048 - 0x0048)
class UClass_Object_RefCount_VisionNotifier_TribesVisionNotifier : public UClass_Object_RefCount_VisionNotifier
{
public:

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.RefCount.VisionNotifier.TribesVisionNotifier");
		return ptr;
	}


	TArray<class AClass_Object_Actor_Pawn_Rook*> Function_getEnemyList();
	TArray<class AClass_Object_Actor_Pawn_Rook*> Function_getSeenList();
	void Function_RemoveAnyReferencesToPawn_RemoveAnyReferencesToPawn(class AClass_Object_Actor_Pawn* PawnBeingRemoved);
	bool Function_isLocallyVisible(class AClass_Object_Actor_Pawn* TestPawn);
	bool Function_isVisible_isVisible(class AClass_Object_Actor_Pawn* TestPawn);
};


// Class Object.Commandlet
// 0x01B4 (0x01DC - 0x0028)
class UClass_Object_Commandlet : public UClass_Object
{
public:
	struct FString                                     HelpCmd;                                                  // 0x0028(0x000C) (Localized, NeedCtorLink)
	struct FString                                     HelpOneLiner;                                             // 0x0034(0x000C) (Localized, NeedCtorLink)
	struct FString                                     HelpUsage;                                                // 0x0040(0x000C) (Localized, NeedCtorLink)
	struct FString                                     HelpWebLink;                                              // 0x004C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     HelpParm[0x10];                                           // 0x0058(0x000C) (Localized, NeedCtorLink)
	struct FString                                     HelpDesc[0x10];                                           // 0x0118(0x000C) (Localized, NeedCtorLink)
	unsigned long                                      LogToStdout : 1;                                          // 0x01D8(0x0004)
	unsigned long                                      IsServer : 1;                                             // 0x01D8(0x0004)
	unsigned long                                      IsClient : 1;                                             // 0x01D8(0x0004)
	unsigned long                                      IsEditor : 1;                                             // 0x01D8(0x0004)
	unsigned long                                      LazyLoad : 1;                                             // 0x01D8(0x0004)
	unsigned long                                      ShowErrorCount : 1;                                       // 0x01D8(0x0004)
	unsigned long                                      ShowBanner : 1;                                           // 0x01D8(0x0004)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Commandlet");
		return ptr;
	}


	int Function_Main(const struct FString& Parms);
};


// Class Object.Commandlet.NativeListUnitTestCommandlet
// 0x0000 (0x01DC - 0x01DC)
class UClass_Object_Commandlet_NativeListUnitTestCommandlet : public UClass_Object_Commandlet
{
public:

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Commandlet.NativeListUnitTestCommandlet");
		return ptr;
	}

};


// Class Object.CheatManager
// 0x000C (0x0034 - 0x0028)
class UClass_Object_CheatManager : public UClass_Object
{
public:
	struct FStruct_Rotator                             LockedRotation;                                           // 0x0028(0x000C)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.CheatManager");
		return ptr;
	}


	void Function_findCamels();
	void Function_PlayAllCS();
	void Function_Cutscene(const struct FName& cutsceneName);
};


// Class Object.CheatManager.ConsoleCommandManager
// 0x0000 (0x0034 - 0x0034)
class UClass_Object_CheatManager_ConsoleCommandManager : public UClass_Object_CheatManager
{
public:

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.CheatManager.ConsoleCommandManager");
		return ptr;
	}


	void Function_applySkin(const struct FString& skinPath);
	void Function_DebugEffectEvent(const struct FName& EffectEvent);
	void Function_modCharVis(const struct FName& CharacterName, const struct FName& Mode);
	void Function_toggleModifyHUD();
	void Function_SetMass(const struct FName& ActorName, float newMass);
	void Function_OffsetPosition(const struct FName& ActorName, float posZ);
	void Function_setPosition(const struct FName& ActorName, float posX, float posY, float posZ);
	void Function_setAcceleration(const struct FName& ActorName, float magnitude);
	void Function_setVelocity(const struct FName& ActorName, float magnitude);
	void Function_AddVelocity(const struct FName& ActorName, float magnitude);
	void Function_AddTorque(const struct FName& ActorName, float magnitude);
	void Function_addForce(const struct FName& ActorName, float magnitude, float Offset);
	void Function_AddForceAtPosition(const struct FName& ActorName, float magnitude, float Offset);
	void Function_addImpulse(const struct FName& ActorName, float magnitude, float Offset);
	void Function_AddImpulseAtPosition(const struct FName& ActorName, float magnitude);
	void Function_UnifiedGetMethodsTest(const struct FName& ActorName);
	void Function_SetState(const struct FName& ActorName, const struct FName& NewState);
	void Function_spectate(const struct FString& PlayerName);
	void Function_ChangeTeam(int i);
	void Function_switchTeam();
	void Function_setRoundTime(float t);
	void Function_toggleWatermark();
	void Function_showHUD(bool B);
	void Function_showFirstPersonGun(bool B);
	void Function_logDLM(const struct FName& aiLabel);
	void Function_logTyrion(const struct FName& aiLabel);
	void Function_logCersei(const struct FName& aiLabel);
	void Function_logNavigationSystem(const struct FName& aiLabel);
	void Function_debugJS(const struct FName& aiLabel);
	void Function_debugLOA(const struct FName& aiLabel);
	void Function_debugSensing(const struct FName& aiLabel);
	void Function_disableAI(const struct FName& aiLabel);
	void Function_debugNav(const struct FName& aiLabel);
	void Function_debugAI(const struct FName& aiLabel);
};


// Class Object.Armor
// 0x0100 (0x0128 - 0x0028)
class UClass_Object_Armor : public UClass_Object
{
public:
	float                                              CollisionRadius;                                          // 0x0028(0x0004) (Edit, NoClear)
	float                                              CollisionHeight;                                          // 0x002C(0x0004) (Edit, NoClear)
	class UClass_Object_Field_Struct_State_Class*      HavokParamsClass;                                         // 0x0030(0x0004) (Edit, NoClear)
	float                                              breathingDurationMod;                                     // 0x0034(0x0004) (Edit, NoClear)
	float                                              Health;                                                   // 0x0038(0x0004) (Edit, NoClear)
	float                                              energy;                                                   // 0x003C(0x0004) (Edit, NoClear)
	float                                              ammoMod;                                                  // 0x0040(0x0004) (Edit, NoClear)
	float                                              collisionDamageMod;                                       // 0x0044(0x0004) (Edit, NoClear)
	float                                              noise;                                                    // 0x0048(0x0004) (Edit, NoClear)
	float                                              jetPackNoise;                                             // 0x004C(0x0004) (Edit, NoClear)
	float                                              EyeHeight;                                                // 0x0050(0x0004) (Edit, NoClear)
	float                                              headFraction;                                             // 0x0054(0x0004) (Edit, NoClear)
	class UClass_Object_Material*                      hudIcon;                                                  // 0x0058(0x0004) (Edit, NoClear)
	int                                                maxCarriedWeapons;                                        // 0x005C(0x0004) (Edit, NoClear)
	struct FString                                     movementConfiguration;                                    // 0x0060(0x000C) (Edit, NeedCtorLink, NoClear)
	struct FString                                     movementConfigurationFastActive;                          // 0x006C(0x000C) (Edit, NeedCtorLink, NoClear)
	struct FString                                     movementConfigurationFastPassive;                         // 0x0078(0x000C) (Edit, NeedCtorLink, NoClear)
	class UClass_Object_Field_Struct_State_Class*      movementDamageTypeClass;                                  // 0x0084(0x0004) (Edit, NoClear)
	class UClass_Object_Field_Struct_State_Class*      movementDamageOtherTypeClass;                             // 0x0088(0x0004) (Edit, NoClear)
	class UClass_Object_Field_Struct_State_Class*      movementCrushingDamageTypeClass;                          // 0x008C(0x0004) (Edit, NoClear)
	unsigned long                                      bUseAlternateWeaponMesh : 1;                              // 0x0090(0x0004) (Edit, NoClear)
	int                                                heightIndex;                                              // 0x0094(0x0004) (Edit, NoClear)
	struct FString                                     armorName;                                                // 0x0098(0x000C) (Edit, Localized, NeedCtorLink, NoClear)
	struct FString                                     infoString;                                               // 0x00A4(0x000C) (Edit, Localized, NeedCtorLink, NoClear)
	class UClass_Object_Field_Struct_State_Class*      personalShieldClass;                                      // 0x00B0(0x0004) (Edit, NoClear)
	struct FString                                     SpeechTag;                                                // 0x00B4(0x000C) (Edit, NeedCtorLink, NoClear)
	class UClass_Object_Field_Struct_State_Class*      radarInfoClass;                                           // 0x00C0(0x0004) (Edit, NoClear)
	unsigned long                                      bCanUseTurrets : 1;                                       // 0x00C4(0x0004) (Edit, NoClear)
	class UClass_Object_Field_Struct_State_Class*      fallbackWeaponClass;                                      // 0x00C8(0x0004) (Edit, NoClear)
	float                                              knockbackScale;                                           // 0x00CC(0x0004) (Edit, NoClear)
	class UClass_Object_Field_Struct_State_Class*      suicideDamageTypeClass;                                   // 0x00D0(0x0004) (Edit, NoClear)
	unsigned long                                      bRestrictions : 1;                                        // 0x00D4(0x0004)
	TArray<struct FStruct_QuantityWeapon>              AllowedWeapons;                                           // 0x00D8(0x000C) (Edit, NeedCtorLink, EditInline)
	struct FStruct_QuantityGrenades                    AllowedGrenades;                                          // 0x00E4(0x0008) (Edit, EditInline)
	TArray<class UClass_Object_Field_Struct_State_Class*> AllowedPacks;                                             // 0x00EC(0x000C) (Edit, NeedCtorLink)
	TArray<struct FStruct_QuantityDeployable>          AllowedDeployables;                                       // 0x00F8(0x000C) (Edit, NeedCtorLink, EditInline)
	TArray<struct FStruct_QuantityConsumable>          AllowedConsumables;                                       // 0x0104(0x000C) (Edit, NeedCtorLink, EditInline)
	TArray<class UClass_Object_Field_Struct_State_Class*> AllowedDriver;                                            // 0x0110(0x000C) (Edit, NeedCtorLink)
	TArray<class UClass_Object_Field_Struct_State_Class*> AllowedPassenger;                                         // 0x011C(0x000C) (Edit, NeedCtorLink)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Armor");
		return ptr;
	}


	bool STATIC_Function_useAlternateWeaponMesh();
	void STATIC_Function_equip(class AClass_Object_Actor_Pawn_Rook_Ragdoll_Character* C);
	class UClass_Object_Field_Struct_State_Class* STATIC_Function_getHandGrenadeClass();
	int STATIC_Function_maxGrenades();
	class UClass_Object_Field_Struct_State_Class* STATIC_Function_getHealthKitClass();
	int STATIC_Function_maxHealthKits();
	int STATIC_Function_maxConsumable(class UClass_Object_Field_Struct_State_Class* typeClass);
	int STATIC_Function_maxDeployable(class UClass_Object_Field_Struct_State_Class* typeClass);
	int STATIC_Function_maxAmmo(class UClass_Object_Field_Struct_State_Class* typeClass);
	bool STATIC_Function_isPassengerAllowed(class UClass_Object_Field_Struct_State_Class* typeClass);
	bool STATIC_Function_isDriverAllowed(class UClass_Object_Field_Struct_State_Class* typeClass);
	bool STATIC_Function_isConsumableAllowed(class UClass_Object_Field_Struct_State_Class* typeClass);
	bool STATIC_Function_isDeployableAllowed(class UClass_Object_Field_Struct_State_Class* typeClass);
	bool STATIC_Function_isPackAllowed(class UClass_Object_Field_Struct_State_Class* typeClass);
	bool STATIC_Function_isWeaponAllowed(class UClass_Object_Field_Struct_State_Class* typeClass);
};


// Class Object.Material
// 0x0018 (0x0040 - 0x0028)
class UClass_Object_Material : public UClass_Object
{
public:
	class UClass_Object_Material*                      FallbackMaterial;                                         // 0x0028(0x0004) (Edit)
	class UClass_Object_Material*                      DefaultMaterial;                                          // 0x002C(0x0004)
	unsigned long                                      UseFallback : 1;                                          // 0x0030(0x0004) (Const, Transient)
	unsigned long                                      Validated : 1;                                            // 0x0030(0x0004) (Const, Transient)
	TEnumAsByte<EMaterialType>                         MaterialType;                                             // 0x0034(0x0001) (Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	int                                                MaterialSoundType;                                        // 0x0038(0x0004) (Edit)
	TEnumAsByte<EMaterialVisualType>                   MaterialVisualType;                                       // 0x003C(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x003D(0x0003) MISSED OFFSET

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Material");
		return ptr;
	}


	void Function_Trigger(class AClass_Object_Actor* Other, class AClass_Object_Actor* EventInstigator);
	void Function_Reset();
	int Function_GetVSize();
	int Function_GetUSize();
};


// Class Object.Material.Modifier
// 0x0004 (0x0044 - 0x0040)
class UClass_Object_Material_Modifier : public UClass_Object_Material
{
public:
	class UClass_Object_Material*                      Material;                                                 // 0x0040(0x0004) (Edit, EditInline, EditInlineUse)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Material.Modifier");
		return ptr;
	}


	void Function_Trigger_Trigger(class AClass_Object_Actor* Other, class AClass_Object_Actor* EventInstigator);
	void Function_Reset_Reset();
	int Function_GetVSize_GetVSize();
	int Function_GetUSize_GetUSize();
};


// Class Object.Material.Modifier.TexModifier
// 0x0008 (0x004C - 0x0044)
class UClass_Object_Material_Modifier_TexModifier : public UClass_Object_Material_Modifier
{
public:
	TEnumAsByte<ETexCoordSrc>                          TexCoordSource;                                           // 0x0044(0x0001)
	TEnumAsByte<ETexCoordCount>                        TexCoordCount;                                            // 0x0045(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0046(0x0002) MISSED OFFSET
	unsigned long                                      TexCoordProjected : 1;                                    // 0x0048(0x0004)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Material.Modifier.TexModifier");
		return ptr;
	}

};


// Class Object.Material.Modifier.TexModifier.TexMatrix
// 0x0040 (0x008C - 0x004C)
class UClass_Object_Material_Modifier_TexModifier_TexMatrix : public UClass_Object_Material_Modifier_TexModifier
{
public:
	struct FStruct_Matrix                              Matrix;                                                   // 0x004C(0x0040)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Material.Modifier.TexModifier.TexMatrix");
		return ptr;
	}

};


// Class Object.Material.Modifier.TexModifier.TexMatrix.ControllableTexMatrix
// 0x001C (0x00A8 - 0x008C)
class UClass_Object_Material_Modifier_TexModifier_TexMatrix_ControllableTexMatrix : public UClass_Object_Material_Modifier_TexModifier_TexMatrix
{
public:
	struct FStruct_Rotator                             rotationAxis;                                             // 0x008C(0x000C)
	float                                              Rotation;                                                 // 0x0098(0x0004)
	float                                              panU;                                                     // 0x009C(0x0004)
	float                                              panV;                                                     // 0x00A0(0x0004)
	float                                              Scale;                                                    // 0x00A4(0x0004)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Material.Modifier.TexModifier.TexMatrix.ControllableTexMatrix");
		return ptr;
	}

};


// Class Object.Material.Modifier.TexModifier.ControllableTextureRotator
// 0x0058 (0x00A4 - 0x004C)
class UClass_Object_Material_Modifier_TexModifier_ControllableTextureRotator : public UClass_Object_Material_Modifier_TexModifier
{
public:
	struct FStruct_Rotator                             Rotation;                                                 // 0x004C(0x000C)
	struct FStruct_Matrix                              M;                                                        // 0x0058(0x0040)
	float                                              Scale;                                                    // 0x0098(0x0004)
	float                                              UOffset;                                                  // 0x009C(0x0004)
	float                                              VOffset;                                                  // 0x00A0(0x0004)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Material.Modifier.TexModifier.ControllableTextureRotator");
		return ptr;
	}

};


// Class Object.Material.Modifier.TexModifier.ControllableTexturePanner
// 0x0050 (0x009C - 0x004C)
class UClass_Object_Material_Modifier_TexModifier_ControllableTexturePanner : public UClass_Object_Material_Modifier_TexModifier
{
public:
	struct FStruct_Vector                              PanDirection;                                             // 0x004C(0x000C) (Edit)
	struct FStruct_Matrix                              M;                                                        // 0x0058(0x0040)
	float                                              Scale;                                                    // 0x0098(0x0004)

	static UClass_Object_Field_Struct_State_Class* StaticClass()
	{
		static auto ptr = UClass_Object::FindClass("Class Object.Material.Modifier.TexModifier.ControllableTexturePanner");
		return ptr;
	}

};


// Class Object.RefCount.ClientSideCharacter
// 0x0660 (0x0698 - 0x0038)
class UClass_Object_RefCount_ClientSideCharacter : public UClass_Object_RefCount
{
public:
	int                                                MouseX;                                                   // 0x0038(0x0004)
	int                                                MouseY;                                                   // 0x003C(0x0004)
	TEnumAsByte<EColorType>                            UserPrefColorType;                                        // 0x0040(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0041(0x0003) MISSED OFFSET
	float                                              levelTimeSeconds;                                         // 0x0044(0x0004)
	unsigned long                                      bNeedCountDownTimer : 1;                                  // 0x0048(0x0004)
	unsigned long                                      bRoundCountingDown : 1;                                   // 0x0048(0x0004)
	float                                              countDown;                                                // 0x004C(0x0004)
	float                                              respawnTime;                                              // 0x0050(0x0004)
	struct FStruct_Vector                              charLocation;                                             // 0x0054(0x000C)
	struct FStruct_Rotator                             charRotation;                                             // 0x0060(0x000C)
	float                                              Velocity;                                                 // 0x006C(0x0004)
	struct FString                                     promptText;                                               // 0x0070(0x000C) (NeedCtorLink)
	struct FStruct_Vector                              useableObjectLocation;                                    // 0x007C(0x000C)
	unsigned long                                      bUseableObjectSwitch : 1;                                 // 0x0088(0x0004)
	unsigned long                                      bCanBeUsed : 1;                                           // 0x0088(0x0004)
	unsigned long                                      bEnabledForUse : 1;                                       // 0x0088(0x0004)
	unsigned long                                      bUseableObjectPowered : 1;                                // 0x0088(0x0004)
	float                                              Health;                                                   // 0x008C(0x0004)
	float                                              healthMaximum;                                            // 0x0090(0x0004)
	float                                              energy;                                                   // 0x0094(0x0004)
	float                                              energyMaximum;                                            // 0x0098(0x0004)
	unsigned long                                      bShowEnergyBar : 1;                                       // 0x009C(0x0004)
	float                                              energyWeaponDepleted;                                     // 0x00A0(0x0004)
	float                                              healthInjectionAmount;                                    // 0x00A4(0x0004)
	unsigned long                                      bHotkeysUpdated : 1;                                      // 0x00A8(0x0004)
	float                                              throwForceMax;                                            // 0x00AC(0x0004)
	float                                              throwForce;                                               // 0x00B0(0x0004)
	unsigned long                                      bZoomed : 1;                                              // 0x00B4(0x0004)
	float                                              zoomMagnificationLevel;                                   // 0x00B8(0x0004)
	int                                                activeWeaponIdx;                                          // 0x00BC(0x0004)
	struct FStruct_HUDWeaponInfo                       activeWeapon;                                             // 0x00C0(0x0024) (NeedCtorLink)
	struct FStruct_HUDWeaponInfo                       fallbackWeapon;                                           // 0x00E4(0x0024) (NeedCtorLink)
	struct FStruct_HUDWeaponInfo                       weapons[0x3];                                             // 0x0108(0x0024) (NeedCtorLink)
	struct FStruct_HUDWeaponInfo                       grenades;                                                 // 0x0174(0x0024) (NeedCtorLink)
	class UClass_Object_Field_Struct_State_Class*      carryable;                                                // 0x0198(0x0004)
	int                                                numCarryables;                                            // 0x019C(0x0004)
	class UClass_Object_Field_Struct_State_Class*      Deployable;                                               // 0x01A0(0x0004)
	class UClass_Object_Field_Struct_State_Class*      questItem;                                                // 0x01A4(0x0004)
	class UClass_Object_Field_Struct_State_Class*      Pack;                                                     // 0x01A8(0x0004)
	class UClass_Object_Field_Struct_State_Class*      HealthKit;                                                // 0x01AC(0x0004)
	int                                                healthKitQuantity;                                        // 0x01B0(0x0004)
	struct FString                                     deployableHotkey;                                         // 0x01B4(0x000C) (NeedCtorLink)
	struct FString                                     healthKitHotkey;                                          // 0x01C0(0x000C) (NeedCtorLink)
	struct FString                                     packHotkey;                                               // 0x01CC(0x000C) (NeedCtorLink)
	struct FString                                     carryableHotkey;                                          // 0x01D8(0x000C) (NeedCtorLink)
	TEnumAsByte<EeDeployableInfo>                      deployableState;                                          // 0x01E4(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x01E5(0x0003) MISSED OFFSET
	unsigned long                                      bDeployableActive : 1;                                    // 0x01E8(0x0004)
	float                                              deployableUseTime;                                        // 0x01EC(0x0004)
	TEnumAsByte<EePackState>                           packState;                                                // 0x01F0(0x0001)
	unsigned char                                      UnknownData02[0x3];                                       // 0x01F1(0x0003) MISSED OFFSET
	float                                              packProgressRatio;                                        // 0x01F4(0x0004)
	struct FStruct_SpawnPointData                      spawnAreas[0x14];                                         // 0x01F8(0x001C) (NeedCtorLink)
	unsigned long                                      bShowRespawnMap : 1;                                      // 0x0428(0x0004)
	unsigned long                                      bInstantRespawnMode : 1;                                  // 0x0428(0x0004)
	class UClass_Object_Field_Struct_State_Class*      GameClass;                                                // 0x042C(0x0004)
	unsigned long                                      bAwaitingTournamentStart : 1;                             // 0x0430(0x0004)
	int                                                ownTeamScore;                                             // 0x0434(0x0004)
	int                                                otherTeamScore;                                           // 0x0438(0x0004)
	struct FString                                     ownTeam;                                                  // 0x043C(0x000C) (NeedCtorLink)
	struct FString                                     otherTeam;                                                // 0x0448(0x000C) (NeedCtorLink)
	class UClass_Object_Material*                      ownTeamIcon;                                              // 0x0454(0x0004)
	class UClass_Object_Material*                      otherTeamIcon;                                            // 0x0458(0x0004)
	struct FStruct_Color                               ownTeamColor;                                             // 0x045C(0x0004)
	struct FStruct_Color                               ownTeamHighlightColor;                                    // 0x0460(0x0004)
	struct FStruct_Color                               otherTeamColor;                                           // 0x0464(0x0004)
	struct FStruct_Color                               otherTeamHighlightColor;                                  // 0x0468(0x0004)
	unsigned long                                      bNoMoreCarryables : 1;                                    // 0x046C(0x0004)
	struct FStruct_Color                               relativeFriendlyTeamColor;                                // 0x0470(0x0004)
	struct FStruct_Color                               relativeFriendlyHighlightColor;                           // 0x0474(0x0004)
	struct FStruct_Color                               relativeEnemyTeamColor;                                   // 0x0478(0x0004)
	struct FStruct_Color                               relativeEnemyHighlightColor;                              // 0x047C(0x0004)
	struct FStruct_Color                               neutralColor;                                             // 0x0480(0x0004)
	struct FStruct_Color                               neutralHighlightColor;                                    // 0x0484(0x0004)
	unsigned long                                      bHitObject : 1;                                           // 0x0488(0x0004)
	float                                              lastHitObjectTime;                                        // 0x048C(0x0004)
	int                                                DamageAmounts[0x7];                                       // 0x0490(0x0004)
	class UClass_Object_Field_Struct_State_Class*      targetType;                                               // 0x04AC(0x0004)
	struct FString                                     targetLabel;                                              // 0x04B0(0x000C) (NeedCtorLink)
	float                                              targetHealth;                                             // 0x04BC(0x0004)
	float                                              targetHealthMax;                                          // 0x04C0(0x0004)
	float                                              targetShield;                                             // 0x04C4(0x0004)
	float                                              targetShieldMax;                                          // 0x04C8(0x0004)
	float                                              targetDistance;                                           // 0x04CC(0x0004)
	float                                              targetFunctionalHealthThreshold;                          // 0x04D0(0x0004)
	TEnumAsByte<ETeamAlignment>                        targetTeamAlignment;                                      // 0x04D4(0x0001)
	unsigned char                                      UnknownData03[0x3];                                       // 0x04D5(0x0003) MISSED OFFSET
	class UClass_Object_Field_Struct_State_Class*      targetTeam;                                               // 0x04D8(0x0004)
	unsigned long                                      targetCanBeDamaged : 1;                                   // 0x04DC(0x0004)
	TArray<struct FStruct_HUDPositionData>             vehiclePositionData;                                      // 0x04E0(0x000C) (NeedCtorLink)
	class UClass_Object_Material*                      vehicleManifestSchematic;                                 // 0x04EC(0x0004)
	float                                              vehicleHealth;                                            // 0x04F0(0x0004)
	float                                              vehicleHealthMaximum;                                     // 0x04F4(0x0004)
	float                                              turretHealth;                                             // 0x04F8(0x0004)
	float                                              turretHealthMaximum;                                      // 0x04FC(0x0004)
	unsigned long                                      bCanExitRespawnHUD : 1;                                   // 0x0500(0x0004)
	struct FString                                     ExitRespawnKeyText;                                       // 0x0504(0x000C) (NeedCtorLink)
	int                                                ExitRespawnKeyBinding;                                    // 0x0510(0x0004)
	struct FString                                     ShowCommandMapKeyText;                                    // 0x0514(0x000C) (NeedCtorLink)
	int                                                livesLeft;                                                // 0x0520(0x0004)
	unsigned long                                      bWaitingForRoundEnd : 1;                                  // 0x0524(0x0004)
	int                                                matchScoreLimit;                                          // 0x0528(0x0004)
	struct FString                                     watchedPlayerName;                                        // 0x052C(0x000C) (NeedCtorLink)
